/**
 * Домашнє завдання 13
 * Завдання 4
 * Створіть масив чисел розмірністю 1000000 або більше.
 * Використовуючи генератор випадкових чисел, проініціалізуйте цей масив значеннями.
 * Створіть PLINQ запит, який дозволить отримати усі непарні числа з вихідного масиву
 */

Random r = new Random();

int[] array = new int[1_000_000];

Parallel.For(0, 1_000_000, (i) => array[i] = r.Next(0, 1_000_000));

var oddNumbers = array.AsParallel().Where(n => n % 2 != 0);

Parallel.ForEach(oddNumbers, n => Console.Write(" {0},", n));